"""
Предложить пользователю оставить свой отзыв о покупке товара
и вывести сообщение о том, что его отзыв был принят.

Тест:

Входные данные:

"Этот товар очень хороший!"

Выходные данные:

"Ваш отзыв 'Этот товар очень хороший!' был принят"

Задание считается выполненным, если тесты пройдены на 100%.
"""
print(f"Ваш отзыв '{input()}' был принят")