"""
Спросить у пользователя, какой товар он хочет купить,
и вывести сообщение о том, что его покупка будет выполнена.

Тест:

Входные данные:

"кофе"

Выходные данные:

"Ваша покупка 'кофе' будет выполнена"

Задание считается выполненным, если тесты пройдены на 100%.
"""
print(f"Ваша покупка '{input()}' будет выполнена")