"""
Запросить у пользователя его имя и вывести приветственное сообщение с его именем.

Тест:

Входные данные:

"Анна"

Выходные данные:

"Привет, Анна!"

Задание считается выполненным, если тесты пройдены на 100%.
"""
print(f'Привет, {input()}!')